{
  "stories": [
    {
      "title": "My husband lives with his parents full-time and only comes to our house to sleep",
      "main_character_gender": "female",
      "num_parts": 3,
      "description": "A woman moves to the US for her husband, only to realize he still lives as if he's single—with his parents, while she is left alone in their home.",
      "tags": [
        "relationship",
        "marriage",
        "loneliness",
        "family",
        "reddit"
      ],
      "parts": [
        {
          "part_number": 1,
          "content": "I am not even sure how to begin this. I just feel really… alone. My husband and I have been together for almost six years, married for a little over one. I moved from Canada to the US to be with him, leaving behind my family, my friends, the life I knew, because I thought marriage would finally mean we'd share our lives, for real. But now that I'm here, it doesn't feel like we live together at all.\n\nHe spends almost all of his time at his parents' house. He goes there for breakfast every morning, works remotely from there, showers there, keeps all his stuff—his clothes, his computer, everything—there. I also work remotely, but I am alone in our home. Every day.\n\nAround three thirty in the afternoon, I go over to join them for lunch. I help wash the dishes, sometimes I stay longer just to be with him. At six thirty in the evening, we usually go to the gym together—that's one of the few parts of the day we share. But on days we don't go, I am just home alone from after lunch until about eleven at night, when he finally comes back to sleep.\n\nHe says I should be grateful. That I have it easy. That I don't appreciate how \"good\" my life is. But I didn't imagine marriage would feel like this—like I'm still waiting for it to begin.\n\nI try to hold things together. I do most of the chores at home. I try not to complain because, well, he's not really here. I've also been the one buying furniture, decorating, slowly trying to make this place feel like a real home. He's never really bought anything for the house. I guess because he doesn't see it as his. But lately… I'm tired. I don't feel motivated to add anything else to this space, because no matter what I do, it still feels like it's just my space. Not ours."
        },
        {
          "part_number": 2,
          "content": "Last weekend, he said we should save money and stop eating out. I agreed. I actually love cooking, but I don't really get the chance to because he always wants to eat at his parents' house. He says it's easier. That his mom \"does a better job.\" So I finally made lunch for him. I was excited. But for one of the dishes I used the wrong oil—we only had olive oil at home—and he got so upset he later even called me a moron. He also said I needed to \"learn from his mother\" and that I wasted too much time cooking. It took three hours, including prep, cooking, and washing the dishes. I don't think I'll ever forget the way that felt.\n\nI had a miscarriage last year with him, and before that happened, he wasn't really there for me. I carried heavy suitcases by myself. He wasn't around for me that much, he was mostly busy with his own chores and his parents' chores. But during the miscarriage, he showed up. He was supportive, he even cried multiple times for the loss of our baby. And afterward, he told me that if I ever got pregnant again, he would move in and actually be present.\n\nNow my period is eighteen days late—but I've tested negative on pregnancy tests—and when I asked his opinion on moving in, he says the solution is for me to move into his parents' house, so we can all be together.\n\nI know he wants to take care of them. They are getting older. He says it would make life easier. I get it. But I've already given up so much, I just really want my own space. I've never really had my own space growing up.\n\nI don't know how to explain it. I just feel like… I'm disappearing.\n\nAnd when he's upset, sometimes he swears at me. He'll say things like, \"What the hell is wrong with you,\" or \"You're a fucking moron,\" or tell me I'm crazy."
        },
        {
          "part_number": 3,
          "content": "I hate it. I can't stop crying after he says things like that. I just… break. I don't think he realizes how deeply it cuts.\n\nAnd the confusing part is—we also have good times. He can be sweet, and funny, and supportive in certain moments. We laugh together sometimes. We go to the gym. We have quiet, peaceful weekends now and then. But it's like those moments never fully erase the weight of everything else.\n\nHe also refuses to have an official wedding. I've told him so many times that it means something to me, but he says I care about the wrong things. And when I talk about my dreams or ideas, he shuts them down. Says I need to be practical. Just find another job. My current job is around ninety-eight thousand CAD. Have a baby. Help him buy another house, so we can all live with his parents.\n\nHe does pay for the mortgage, and since I'm still earning CAD, he says he doesn't want me to contribute right now because the exchange rate is bad. He's also made it clear that he wants me to start earning in USD as soon as possible to help him. And honestly… I feel bad that I can't contribute more financially. It makes me wonder if I even have the right to complain about how things feel. Like maybe I should just be quiet, grateful, and stop asking for more.\n\nI don't know what to do. Has anyone else felt like this in their marriage?"
        }
      ]
    }
  ]
}